In [1]:
!pip install xlrd

/home/angelo/.local/lib/python3.8/site-packages/cryptography/hazmat/backends/openssl/x509.py:14: CryptographyDeprecationWarning: This version of cryptography contains a temporary pyOpenSSL fallback path. Upgrade pyOpenSSL now.
  warnings.warn(
Collecting xlrd
  Using cached xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [2]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/angelo/.local/lib/python3.8/site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in /home/angelo/.local/lib/python3.8/site-packages (from openpyxl) (1.1.0)

In [3]:
import pandas as pd
import datetime
import glob
import math

In [4]:
import pymysql

## Conexão com o banco de dados

In [5]:
from sqlalchemy.engine import create_engine
engine= create_engine('mysql+pymysql://root:bootcamp@127.0.0.1:3307/employees')

In [6]:
df_performance_evaluation = pd.read_json("../datalake/landing/performance-evaluation/employee_performance_evaluation.json",orient="records",lines=True)

In [7]:
df_performance_evaluation.head()

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

## Retorna o numero de projetos por colaborador

In [8]:
query = """ SELECT Count(PROJECT_ID) as number_projects
        FROM projects_emp
        GROUP BY (emp_id); """

In [9]:
df_number_projects= pd.read_sql_query(query,engine)

In [10]:
df_number_projects.head()

   number_projects
0                2
1                5
2                7
3                5
4                2

## Criar a carga de trabalha nos ultimos 3 meses

In [11]:
df_sistema_ponto= pd.DataFrame(data=None, columns=["emp_id", "data", "hora"])

### Carregando os dados do registro de horas trabalhadas

In [12]:
import openpyxl
for sheet in glob.glob("../datalake/landing/working-hours/*.xlsx"):
    df_ =pd.read_excel(sheet,engine= 'openpyxl' )
    df_sistema_ponto = pd.concat([df_sistema_ponto, df_])

In [13]:
df_sistema_ponto.head()

  emp_id       data hora
0  10001 2020-05-31    4
1  10001 2020-06-01    4
2  10001 2020-06-02   13
3  10001 2020-06-03    9
4  10001 2020-06-04   12

In [14]:
df_sistema_ponto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3225000 entries, 0 to 537499
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   emp_id  object
 1   data    datetime64[ns]
 2   hora    object
dtypes: datetime64[ns](1), object(2)
memory usage: 98.4+ MB

### Convertendo os atributos para o tipo de dados datetime

In [19]:
df_sistema_ponto["hora"]=pd.to_numeric(df_sistema_ponto["hora"])

### Filtrando apenas registros dos últimos 3 meses

In [20]:
df_last_3_months= df_sistema_ponto[(df_sistema_ponto['data']>datetime.datetime(2020,9,30))]

### Verificando a contagem de registros por colaborador

In [21]:
df_last_3_months.groupby("emp_id").count()

        data  hora
emp_id
10001     92    92
10002     92    92
10003     92    92
10004     92    92
10005     92    92
...      ...   ...
24996     92    92
24997     92    92
24998     92    92
24999     92    92
25000     92    92

[15000 rows x 2 columns]

### Calculando o valor médio da quantidade de horas nos últimos 3 meses

In [24]:
mean_last_3_months=df_last_3_months.groupby('emp_id')['hora'].agg('sum')/3

### Atribuindo os dados para o dataframe

In [26]:
mean_last_3_months=pd.DataFrame(data=mean_last_3_months)

In [27]:
mean_last_3_months.rename(columns={'hora':'mean_work_last_3_months'},inplace=True)

In [28]:
mean_last_3_months.head()

        mean_work_last_3_months
emp_id
10001                266.000000
10002                252.000000
10003                289.666667
10004                275.666667
10005                292.333333

## Criando o atributo Time_in_Company

### Pegando uma data para referencia

In [30]:
date_reference=datetime.date(2021,1,1)

In [31]:
query= """ SELECT hire_date 
            from employees;"""

In [32]:
df_hire_date= pd.read_sql_query(query, engine)

In [34]:
df_hire_date['hire_date']=pd.to_datetime(df_hire_date['hire_date'])

### Calculando a diferenca de dias da data de referencia para o dia que o colaborador entrou na empresa

In [38]:
days_diff=[]
for colaborator in df_hire_date['hire_date']:
    diff=date_reference - colaborator.date()
    days_diff.append(diff.days)

In [40]:
years=[]
for days in days_diff:
    years.append(int(math.ceil(days/365)))

In [42]:
df_hire_date['time_in_company']=years

In [43]:
df_hire_date

       hire_date  time_in_company
0     2018-01-17                3
1     2015-02-02                6
2     2017-01-22                4
3     2016-01-28                5
4     2018-01-17                3
...          ...              ...
14994 2018-01-17                3
14995 2018-01-17                3
14996 2018-01-17                3
14997 2017-01-22                4
14998 2018-01-17                3

[14999 rows x 2 columns]

## Verificar se o empregado ja sofreu acidente

## Criando a coluna Work_Accident

In [45]:
df_employees=pd.read_sql_table("employees",engine)

In [46]:
df_accident=pd.read_sql_table("accident",engine)

In [52]:
work_accident=[]
for emp in df_employees['emp_no']:
    if emp in df_accident['emp_no'].to_list():
        work_accident.append(1)
    else: 
        work_accident.append(0)

In [54]:
df_work_accident=pd.DataFrame(data=None, columns=['work_accident'])

In [56]:
df_work_accident['work_accident']=work_accident

In [57]:
df_work_accident

       work_accident
0                  0
1                  0
2                  0
3                  0
4                  0
...              ...
14994              0
14995              0
14996              0
14997              0
14998              0

[14999 rows x 1 columns]

## Atributos Department, Salary e Left

In [58]:
query = """ SELECT emp.department as department, sal.salary as salary, emp.left
            FROM employees emp 
            INNER JOIN salaries sal
            ON emp.emp_no=sal.emp_id;
            """

In [60]:
df_department_salary_left=pd.read_sql_query(query, engine)

In [61]:
df_department_salary_left.head()

  department  salary  left
0      sales     low     1
1      sales  medium     1
2      sales  medium     1
3      sales     low     1
4      sales     low     1